{"loss": "mse", "config": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 17], "output_dim": 17, "input_dtype": "float32", "activation": "linear", "bias": true, "W_regularizer": null, "b_constraint": null, "input_dim": 17, "b_regularizer": null, "W_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 17], "output_dim": 17, "input_dtype": "float32", "activation": "linear", "bias": true, "W_regularizer": null, "b_constraint": null, "input_dim": 17, "b_regularizer": null, "W_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 17], "output_dim": 1, "input_dtype": "float32", "activation": "linear", "bias": true, "W_regularizer": null, "b_constraint": null, "input_dim": 17, "b_regularizer": null, "W_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "sigmoid"}}], "sample_weight_mode": null, "class_name": "Sequential", "optimizer": {"name": "RMSprop", "lr": 0.0010000000474974513, "rho": 0.8999999761581421, "epsilon": 1e-08}, "keras_version": "1.0.6"}