{"keras_version": "1.0.6", "config": [{"config": {"name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": 17, "input_dtype": "float32", "bias": true, "b_constraint": null, "b_regularizer": null, "output_dim": 17, "W_constraint": null, "batch_input_shape": [null, 17], "activation": "linear", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": 17, "input_dtype": "float32", "bias": true, "b_constraint": null, "b_regularizer": null, "output_dim": 17, "W_constraint": null, "batch_input_shape": [null, 17], "activation": "linear", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": 17, "input_dtype": "float32", "bias": true, "b_constraint": null, "b_regularizer": null, "output_dim": 1, "W_constraint": null, "batch_input_shape": [null, 17], "activation": "linear", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "loss": "mse", "sample_weight_mode": null, "optimizer": {"name": "RMSprop", "rho": 0.8999999761581421, "lr": 0.0010000000474974513, "epsilon": 1e-08}}